spoemb/linkit-v4-core/ports/nrf52840/main.cpp
#include "sws_analog_service.hpp"
#include "gnss_detector_service.hpp"
#if ENABLE_PRESSURE_SENSOR
#include "pressure_detector_service.hpp"
#include "pressure_sensor_service.hpp"
#endif
#if ENABLE_ALS_SENSOR
#include "als_sensor_service.hpp"
#endif
#if ENABLE_PH_SENSOR
#include "ph_sensor_service.hpp"
#endif
#if ENABLE_SEA_TEMP_SENSOR
#include "sea_temp_sensor_service.hpp"
#endif
#if ENABLE_CDT_SENSOR
#include "cdt_sensor_service.hpp"
#endif
#include "gps_service.hpp"
#if ENABLE_AXL_SENSOR
#include "axl_sensor_service.hpp"
#endif
#include "cam_service.hpp"
#if ENABLE_MORTALITY_SENSOR
#include "mortality_service.hpp"
#endif
#include "argos_tx_service.hpp"
#include "argos_rx_service.hpp"
#include "sys_log.hpp"
#include "nrf_delay.h"
#include "nrf_gpio.h"
#include "nrf_log_redirect.h"
#include "nrfx_spim.h"
#include "ble_interface.hpp"
#include "ota_flash_file_updater.hpp"
#include "dte_handler.hpp"
#include "nrf_memory_access.hpp"
#include "config_store_fs.hpp"
#include "debug.hpp"
#include "console_log.hpp"
#include "bsp.hpp"
#include "gentracker.hpp"
#include "nrf_timer.hpp"
#include "nrf_switch.hpp"
#include "reed.hpp"
#include "nrf_rtc.hpp"
#include "gpio.hpp"
#include "is25_flash.hpp"
#include "nrf_rgb_led.hpp"

// Battery monitor includes based on BATTERY_MONITOR_TYPE
#if defined(BATTERY_MONITOR_ANALOG)
#include "nrf_battery_mon.hpp"
#elif defined(BATTERY_MONITOR_FAKE)
#include "fake_battery_mon.hpp"
#elif defined(BATTERY_MONITOR_STC3117)
#include "stc3117_gasgauge.hpp"
#endif

#if ENABLE_ALS_SENSOR
#include "ltr_303.hpp"
#endif
#if ENABLE_PH_SENSOR
#include "oem_ph.hpp"
#endif
#if ENABLE_SEA_TEMP_SENSOR
#include "oem_rtd.hpp"
#include "ezo_rtd.hpp"
#include "TSYS01.hpp"
#endif
#if ENABLE_CDT_SENSOR || ENABLE_PRESSURE_SENSOR
#include "ms58xx.hpp"
#include "bar100.hpp"
#include "lps28dfw.hpp"
#endif
#if ENABLE_CDT_SENSOR
#include "cdt.hpp"
#include "ad5933.hpp"
#endif
#if ENABLE_AXL_SENSOR
#include "bma400.hpp"
#endif
#include "fs_log.hpp"
#include "nrf_i2c.hpp"
#include "nrf_usb.hpp"
#include "gpio_led.hpp"
#include "heap.h"
#include "etl/error_handler.h"
#include "memory_monitor_service.hpp"
#include "dive_mode_service.hpp"
#include "gpio_buzzer.hpp"
#ifdef CAM_PWR_EN
#include "runcam.hpp"
#endif

// Always use M10Q GPS module
#include "m10qasync.hpp"
#if defined(LORA_RAK3172) && (LORA_RAK3172 == 1)
#include "lora_rak3172.hpp"
#include "lora_tx_service.hpp"
#elif defined(ARGOS_SMD) && (ARGOS_SMD == 1)
#include "smd_sat.hpp"
#if defined(SMD_UART) && (SMD_UART == 1)
#include "smd_sat_cmd_at.hpp"
#else
#include "smd_sat_cmd_spi.hpp"
#endif
#else
#include "kim2.hpp"
#endif
#if ENABLE_THERMISTOR_SENSOR
#include "thermistor_sensor_service.hpp"
#include "thermistor.hpp"
#endif
#ifdef DEBUG_UART_TX_PIN
#include "nrf_debug_uart.hpp"
#endif

FileSystem *main_filesystem;

ConfigurationStore *configuration_store;
BLEService *ble_service;
OTAFileUpdater *ota_updater;
MemoryAccess *memory_access;
Timer *system_timer;
Scheduler *system_scheduler;
RGBLed *status_led;
Led *ext_status_led;
ReedSwitch *reed_switch;
DTEHandler *dte_handler;
RTC *rtc;
BatteryMonitor *battery_monitor;
GPSDevice *gps_device;
KineisDevice *kineis_device_instance = nullptr;  // Generic satellite device (SMD or KIM2)
#if defined(ARGOS_SMD) && (ARGOS_SMD == 1)
SmdSat *smd_sat_instance = nullptr;  // For SMD DFU OTA support
#endif
#if defined(LORA_RAK3172) && (LORA_RAK3172 == 1)
LoRaDevice *lora_device_instance = nullptr;  // For LORATX DTE command
#endif
#if ENABLE_MORTALITY_SENSOR
MortalityService *mortality_service = nullptr;
#endif
#if defined(BOARD_RSPB)
BaseDebugMode g_debug_mode = BaseDebugMode::UART;     // Default debug output to UART on SWO pin for RSPB
#else
BaseDebugMode g_debug_mode = BaseDebugMode::USB_CDC;  // Default debug output to USB CDC for LINKIT
#endif
Buzzer *buzzer_ctl;

static bool m_is_debug_init = false;

// FSM initial state -> BootState
FSM_INITIAL_STATE(GenTracker, BootState)

// Reserve the last 1MB of IS25 flash memory for firmware updates
#define OTA_UPDATE_RESERVED_BLOCKS ((1024 * 1024) / IS25_BLOCK_SIZE)

// Reed switch debouncing time (ms) - increased from 25ms to filter noise from VSENSORS switching
#define REED_SWITCH_DEBOUNCE_TIME_MS    250


extern "C" void HardFault_Handler() {
	for (;;)
	{
#ifdef NDEBUG
		PMU::save_stack(PMULogType::HARDFAULT);
		PMU::reset(false);
#else
		// Hardfault occurred
#ifdef GPIO_LED_REG
		GPIOPins::set(GPIO_LED_REG);
#endif
		GPIOPins::clear(BSP::GPIO::GPIO_LED_RED);
		GPIOPins::set(BSP::GPIO::GPIO_LED_GREEN);
		GPIOPins::set(BSP::GPIO::GPIO_LED_BLUE);
		nrf_delay_ms(50);
		GPIOPins::set(BSP::GPIO::GPIO_LED_RED);
		GPIOPins::set(BSP::GPIO::GPIO_LED_GREEN);
		GPIOPins::set(BSP::GPIO::GPIO_LED_BLUE);
		nrf_delay_ms(50);
		PMU::kick_watchdog();
#endif
	}
}

extern "C" void MemoryManagement_Handler(void)
{
	for (;;)
	{
#ifdef NDEBUG
		PMU::save_stack(PMULogType::MMAN);
		PMU::reset(false);
#else
		// Stack overflow detected
#ifdef GPIO_LED_REG
		GPIOPins::set(GPIO_LED_REG);
#endif
		GPIOPins::set(BSP::GPIO::GPIO_LED_GREEN);
		GPIOPins::set(BSP::GPIO::GPIO_LED_RED);
		GPIOPins::set(BSP::GPIO::GPIO_LED_BLUE);
		nrf_delay_ms(50);
		GPIOPins::clear(BSP::GPIO::GPIO_LED_GREEN);
		GPIOPins::clear(BSP::GPIO::GPIO_LED_RED);
		GPIOPins::set(BSP::GPIO::GPIO_LED_BLUE);
		nrf_delay_ms(50);
		PMU::kick_watchdog();
#endif
	}
}

extern "C" {
	void *__stack_check_guard = (void*)0xDEADBEEF;
	void __wrap___stack_chk_fail(void) {
#ifdef NDEBUG
		PMU::save_stack(PMULogType::STACK);
		PMU::reset(false);
#else
		for (;;)
		{
			// Stack corruption detected
#ifdef GPIO_LED_REG
			GPIOPins::set(GPIO_LED_REG);
#endif
			GPIOPins::set(BSP::GPIO::GPIO_LED_RED);
			GPIOPins::set(BSP::GPIO::GPIO_LED_GREEN);
			GPIOPins::set(BSP::GPIO::GPIO_LED_BLUE);
			nrf_delay_ms(50);
			GPIOPins::clear(BSP::GPIO::GPIO_LED_RED);
			GPIOPins::set(BSP::GPIO::GPIO_LED_GREEN);
			GPIOPins::clear(BSP::GPIO::GPIO_LED_BLUE);
			nrf_delay_ms(50);
			PMU::kick_watchdog();
		}
#endif
	}
}

extern "C" void vApplicationMallocFailedHook() {
	for (;;)
	{
#ifdef NDEBUG
		PMU::save_stack(PMULogType::MALLOC);
		PMU::reset(false);
#else
		// Out of heap memory occurred
#ifdef GPIO_LED_REG
		GPIOPins::set(GPIO_LED_REG);
#endif
		GPIOPins::set(BSP::GPIO::GPIO_LED_RED);
		GPIOPins::clear(BSP::GPIO::GPIO_LED_GREEN);
		GPIOPins::clear(BSP::GPIO::GPIO_LED_BLUE);
		nrf_delay_ms(50);
		GPIOPins::set(BSP::GPIO::GPIO_LED_RED);
		GPIOPins::set(BSP::GPIO::GPIO_LED_GREEN);
		GPIOPins::set(BSP::GPIO::GPIO_LED_BLUE);
		nrf_delay_ms(50);
		PMU::kick_watchdog();
#endif
	}
}

