spoemb/linkit-v4-core/ports/nrf52840/main.cpp
void etl_error_handler(const etl::exception& e)
{
	DEBUG_TRACE("ETL error: %s in %s : %u", e.what(), e.file_name(), e.line_number());

	for (;;)
	{
#ifdef NDEBUG
		PMU::save_stack(PMULogType::ETL);
		PMU::reset(false);
#else
		// ETL error occurred
#ifdef GPIO_LED_REG
		GPIOPins::set(GPIO_LED_REG);
#endif
		GPIOPins::clear(BSP::GPIO::GPIO_LED_RED);
		GPIOPins::set(BSP::GPIO::GPIO_LED_GREEN);
		GPIOPins::set(BSP::GPIO::GPIO_LED_BLUE);
		nrf_delay_ms(200);
		GPIOPins::set(BSP::GPIO::GPIO_LED_RED);
		GPIOPins::set(BSP::GPIO::GPIO_LED_GREEN);
		GPIOPins::set(BSP::GPIO::GPIO_LED_BLUE);
		nrf_delay_ms(200);
		PMU::kick_watchdog();
#endif
	}
}

// Redirect std::cout and printf output to UART, USB CDC, or BLE NUS
// We have to define this as extern "C" as we are overriding a weak C function
extern "C" int _write(int file, char *ptr, int len)
{
#ifdef DEBUG_UART_TX_PIN
	if (g_debug_mode == BaseDebugMode::UART && NrfDebugUart::is_init())
		NrfDebugUart::write(ptr, len);
	else
#endif
	if (g_debug_mode == BaseDebugMode::USB_CDC && m_is_debug_init)
		NrfUSB::write(ptr, len);
	else if (ble_service && !__get_IPSR() && g_debug_mode == BaseDebugMode::BLE_NUS) {
		ble_service->write(std::string(ptr, len));
	}
	return len;
}


int main()
{
	PMU::initialise();
#ifndef DEBUG_NO_WATCHDOG
	PMU::start_watchdog();
	PMU::kick_watchdog();
#endif
	GPIOPins::initialise();

	etl::error_handler::set_callback<etl_error_handler>();

// NOT NECESSARY : On linkit v4 i2c pullups are on V_ADC, not VSYS
// #ifdef GPIO_AG_PWR_PIN
// 	// Current backfeeds from 3V3 -> i2c pullups -> BMA400 -> GPIO_AG_PWR
// 	// Because of this we need to float our GPIO_AG_PWR pin to avoid sinking that current and thus increasing our sleep current
// 	nrf_gpio_cfg_default(BSP::GPIO_Inits[GPIO_AG_PWR_PIN].pin_number);
// #endif

	rtc = &NrfRTC::get_instance();
	NrfRTC::get_instance().init();

    DEBUG_TRACE("Timer..."); // Logs over USB not activated yet, needs system timer
	system_timer = &NrfTimer::get_instance();
	NrfTimer::get_instance().init();

	// Init debug output (UART, USB CDC, or BLE)
	m_is_debug_init = true;
	ConsoleLog console_log;
	DebugLogger::console_log = &console_log;
#ifdef DEBUG_UART_TX_PIN
	if (g_debug_mode == BaseDebugMode::UART) {
		NrfDebugUart::init(DEBUG_UART_TX_PIN);
	} else
#endif
	{
		NrfUSB::init();
	}
    setvbuf(stdout, NULL, _IONBF, 0);
    nrf_log_redirect_init();

	DEBUG_TRACE("RGB LED...");
	NrfRGBLed nrf_status_led("STATUS", BSP::GPIO::GPIO_LED_RED, BSP::GPIO::GPIO_LED_GREEN, BSP::GPIO::GPIO_LED_BLUE, RGBLedColor::WHITE);
	status_led = &nrf_status_led;

#ifdef EXT_LED_PIN
	DEBUG_TRACE("External LED...");
	GPIOLed gpio_led(EXT_LED_PIN);
	ext_status_led = &gpio_led;
#else
	ext_status_led = nullptr;
#endif

	// Ext LED off
	if (ext_status_led)
		ext_status_led->off();

    DEBUG_TRACE("Reed switch...");
    NrfSwitch nrf_reed_switch(BSP::GPIO::GPIO_REED_SW, REED_SWITCH_DEBOUNCE_TIME_MS, REED_SWITCH_ACTIVE_STATE);

#ifdef BUZZER_EN_PIN
	DEBUG_TRACE("Buzzer...");
	Buzzer buzzer(BUZZER_EN_PIN);
	buzzer_ctl = &buzzer;
#else
	buzzer_ctl = nullptr;
#endif

	DEBUG_TRACE("BLE...");
    BleInterface::get_instance().init();

	DEBUG_TRACE("IS25 flash...");
	Is25Flash is25_flash;
	is25_flash.init();

	// Check the reed switch is engaged for 3 seconds if this is a power on event
    DEBUG_TRACE("PMU Reset Cause = %s", PMU::reset_cause().c_str());

	// Note: VSENSORS power is now managed by each sensor via SensorsPowerGuard (reference counting)

#ifdef POWER_ON_RESET_REQUIRES_REED_SWITCH
#ifdef PSEUDO_POWER_OFF

	{
		SensorsPowerGuard power_guard;  // Acquire VSENSORS for I2C bus stability during init
		NrfI2C::init();
		PMU::hardware_version(); // Side-effect: I2C probes for hardware detection
#if ENABLE_SEA_TEMP_SENSOR
		{
			try {
				EZO_RTD_Sensor rtd; // Puts the device into standby mode
			} catch (...) {}
		}
#endif
		NrfI2C::uninit();
	}
	bool is_linkit_v4 = (PMU::hardware_version() == "LinkIt V4");

	if ((is_linkit_v4 && PMU::reset_cause() == "Pseudo Power On Reset") ||
		(!is_linkit_v4 && (PMU::reset_cause() == "Power On Reset" ||
				PMU::reset_cause() == "Pseudo Power On Reset"))) {

		volatile bool power_on_ready = false;
		system_timer->start();
		Timer::TimerHandle timer_handle;

		// Check if switch starting state is active
		if (nrf_reed_switch.get_state()) {
			status_led->set(RGBLedColor::WHITE);
			BUZZER_ON(buzzer_ctl);
			timer_handle = system_timer->add_schedule([&power_on_ready]() {
				DEBUG_TRACE("Reed switch 3s period elapsed");
				power_on_ready = true;
			}, system_timer->get_counter() + 3000);
		} else {
		    // Turn status LED off
		    status_led->off();
			BUZZER_OFF(buzzer_ctl);
		}

		nrf_reed_switch.start([&timer_handle, &power_on_ready](bool state) {
			system_timer->cancel_schedule(timer_handle);
			if (state) {
				DEBUG_TRACE("Reed State: %u", state);
				GPIOPins::set(VSYS_SEL);
				status_led->set(RGBLedColor::WHITE);
				BUZZER_ON(buzzer_ctl);
				timer_handle = system_timer->add_schedule([&power_on_ready]() {
					DEBUG_TRACE("Reed switch 3s period elapsed");
					power_on_ready = true;
				}, system_timer->get_counter() + 3000);
			} else {
				status_led->off();
				GPIOPins::clear(VSYS_SEL);
				BUZZER_OFF(buzzer_ctl);
			}
		});

		// Kick the watchdog periodically while waiting for reed switch
		GPIOPins::clear(VSYS_SEL);
		while (!power_on_ready) {
			PMU::kick_watchdog();
			PMU::run();
		}

		GPIOPins::set(VSYS_SEL);
		PMU::kick_watchdog();
		nrf_reed_switch.stop();
		BUZZER_BEEP_COUNT(buzzer_ctl,200,200,2);
	}
#else
	if (PMU::reset_cause() == "Power On Reset") {
		unsigned int countdown = 3000;
		DEBUG_TRACE("Enter Power On Reed Switch Check");
		while (countdown) {
			//DEBUG_TRACE("Reed Switch: %u", GPIOPins::value(BSP::GPIO_REED_SW));
			if (GPIOPins::value(BSP::GPIO_REED_SW) != REED_SWITCH_ACTIVE_STATE)
				break;
			PMU::delay_ms(1);
			countdown--;
		}

		if (countdown) {
			DEBUG_TRACE("Reed Switch Inactive -- Powering Down...");
			PMU::powerdown();
		}
		DEBUG_TRACE("Exiting Power On Reed Switch Check");
	}
#endif // POWER_CONTROL_PIN
#endif // POWER_ON_RESET_REQUIRES_REED_SWITCH


