spoemb/linkit-v4-core/ports/nrf52840/main.cpp
	DEBUG_TRACE("Scheduler...");
	Scheduler scheduler(system_timer);
	system_scheduler = &scheduler;

    // Initialise the I2C drivers
    // Note: VSENSORS must be on during I2C init to prevent bus appearing stuck
    {
        SensorsPowerGuard power_guard;
        NrfI2C::init();
    }

    DEBUG_TRACE("Reed gesture...");
	ReedSwitch reed_gesture_switch(nrf_reed_switch);
	reed_switch = &reed_gesture_switch;

	DEBUG_TRACE("LFS filesystem...");
	LFSFileSystem lfs_file_system(&is25_flash, IS25_BLOCK_COUNT - OTA_UPDATE_RESERVED_BLOCKS);
	main_filesystem = &lfs_file_system;

	// If we can't mount the filesystem then try to format it first and retry
	DEBUG_TRACE("Mount LFS filesystem...");

#ifdef FORCE_FORMAT_FILESYSTEM
	DEBUG_WARN("FORCE_FORMAT_FILESYSTEM enabled - formatting filesystem!");
	if (main_filesystem->format() < 0 || main_filesystem->mount() < 0)
	{
		DEBUG_ERROR("Failed to format LFS filesystem");
		PMU::powerdown();
	}
#else
	if (main_filesystem->mount() < 0)
	{
		DEBUG_TRACE("Format LFS filesystem...");
		if (main_filesystem->format() < 0 || main_filesystem->mount() < 0)
		{
			// We can't mount a formatted filesystem, something bad has happened
			DEBUG_ERROR("Failed to format LFS filesystem");
			PMU::powerdown();
		}
	}
#endif

	DEBUG_TRACE("Configuration store...");
	LFSConfigurationStore store(lfs_file_system);
	configuration_store = &store;
	configuration_store->init();

#ifdef EXTERNAL_WAKEUP
	{
		// Pseudo RTC: advance the last known RTC by WAKEUP_PERIOD at each boot.
		// This provides an approximate time immediately, before a GNSS fix corrects it.
		unsigned int last_rtc = configuration_store->read_param<unsigned int>(ParamID::LAST_KNOWN_RTC);
		unsigned int wakeup_period = configuration_store->read_param<unsigned int>(ParamID::WAKEUP_PERIOD);
		if (last_rtc > 0 && wakeup_period > 0) {
			unsigned int pseudo_rtc = last_rtc + wakeup_period;
			configuration_store->write_param(ParamID::LAST_KNOWN_RTC, pseudo_rtc);
			rtc->settime(static_cast<std::time_t>(pseudo_rtc));
			DEBUG_INFO("EXTERNAL_WAKEUP: Pseudo RTC set to %u (last=%u + period=%u)", pseudo_rtc, last_rtc, wakeup_period);
		} else {
			DEBUG_INFO("EXTERNAL_WAKEUP: No pseudo RTC available (last_rtc=%u, wakeup_period=%u)", last_rtc, wakeup_period);
		}

		// TPL5111 boot counter management
		// boot_count_increment() calls save_params() which also persists the LAST_KNOWN_RTC update above
		unsigned int boot_counter = configuration_store->boot_count_increment();
		DEBUG_INFO("EXTERNAL_WAKEUP: Boot counter = %u", boot_counter);

		// Check if this is not our turn to run based on modulo
		if (boot_counter > 0 && !configuration_store->boot_count_check_modulo(boot_counter)) {
			if (nrf_reed_switch.get_state()) {
				DEBUG_INFO("EXTERNAL_WAKEUP: Magnet detected | skipping modulo powerdown");
			} else {
				DEBUG_INFO("EXTERNAL_WAKEUP: Not our turn to run (modulo check) | powering down");
				PMU::powerdown();
			}
		}
		DEBUG_INFO("EXTERNAL_WAKEUP: Our turn to run | continuing boot");
	}
#endif

	DEBUG_TRACE("Battery monitor...");
	unsigned int critical_batt_level = configuration_store->read_param<unsigned int>(ParamID::LB_CRITICAL_THRESH);
	unsigned int low_batt_level = configuration_store->read_param<unsigned int>(ParamID::LB_THRESHOLD);

#if defined(BATTERY_MONITOR_ANALOG)
    #ifdef BATTERY_ADC
    NrfBatteryMonitor nrf_battery_monitor(BATTERY_ADC, BATT_CHEM_NCR18650_3100_3400,
    		(uint8_t)critical_batt_level, low_batt_level);
    battery_monitor = &nrf_battery_monitor;
    #else
    static BatteryMonitor stub_battery_monitor(low_batt_level, (uint8_t)critical_batt_level);
    battery_monitor = &stub_battery_monitor;
    #endif
#elif defined(BATTERY_MONITOR_FAKE)
    DEBUG_INFO("Using FAKE battery monitor (always 4.1V)");
    static FakeBatteryMonitor fake_battery_monitor((uint8_t)critical_batt_level, low_batt_level);
    battery_monitor = &fake_battery_monitor;
#elif defined(BATTERY_MONITOR_STC3117)
    DEBUG_INFO("Using STC3117 fuel gauge battery monitor");
    static GaugeBatteryMonitor stc3117_battery_monitor((uint8_t)critical_batt_level, low_batt_level);
    battery_monitor = &stc3117_battery_monitor;
#else
    #error "No battery monitor type defined! Set BATTERY_MONITOR_TYPE in CMake"
#endif

	DEBUG_TRACE("LFS System Log...");
	SysLogFormatter sys_log_formatter;
	FsLog fs_system_log(&lfs_file_system, "system.log", 1024*1024);
	fs_system_log.set_log_formatter(&sys_log_formatter);
	DebugLogger::system_log = &fs_system_log;

	DEBUG_TRACE("LFS (GPS) Sensor Log...");
	GPSLogFormatter fs_sensor_log_formatter;
	FsLog fs_sensor_log(&lfs_file_system, "sensor.log", 1024*1024);
	fs_sensor_log.set_log_formatter(&fs_sensor_log_formatter);

#if ENABLE_ALS_SENSOR
	DEBUG_TRACE("ALS Sensor Log...");
	ALSLogFormatter als_sensor_log_formatter;
	FsLog als_sensor_log(&lfs_file_system, "ALS", 1024*1024);
	als_sensor_log.set_log_formatter(&als_sensor_log_formatter);
#endif

#if ENABLE_PH_SENSOR
	DEBUG_TRACE("PH Sensor Log...");
	PHLogFormatter ph_sensor_log_formatter;
	FsLog ph_sensor_log(&lfs_file_system, "PH", 1024*1024);
	ph_sensor_log.set_log_formatter(&ph_sensor_log_formatter);
#endif

#if ENABLE_SEA_TEMP_SENSOR
	DEBUG_TRACE("RTD Sensor Log...");
	SeaTempLogFormatter rtd_sensor_log_formatter;
	FsLog rtd_sensor_log(&lfs_file_system, "RTD", 1024*1024);
	rtd_sensor_log.set_log_formatter(&rtd_sensor_log_formatter);

	DEBUG_TRACE("TSYS01 Sensor Log...");
	SeaTempLogFormatter tsys01_sensor_log_formatter;
	FsLog tsys01_sensor_log(&lfs_file_system, "TSYS01", 1024*1024);
	tsys01_sensor_log.set_log_formatter(&tsys01_sensor_log_formatter);
#endif

#if ENABLE_CDT_SENSOR
	DEBUG_TRACE("CDT Sensor Log...");
	CDTLogFormatter cdt_sensor_log_formatter;
	FsLog cdt_sensor_log(&lfs_file_system, "CDT", 1024*1024);
	cdt_sensor_log.set_log_formatter(&cdt_sensor_log_formatter);
#endif

#if ENABLE_PRESSURE_SENSOR
	DEBUG_TRACE("PRESSURE Sensor Log...");
	PressureLogFormatter pressure_sensor_log_formatter;
	FsLog pressure_sensor_log(&lfs_file_system, "PRESSURE", 1024*1024);
	pressure_sensor_log.set_log_formatter(&pressure_sensor_log_formatter);
#endif

#if ENABLE_AXL_SENSOR
	DEBUG_TRACE("AXL Sensor Log...");
	AXLLogFormatter axl_sensor_log_formatter;
	FsLog axl_sensor_log(&lfs_file_system, "AXL", 1024*1024);
	axl_sensor_log.set_log_formatter(&axl_sensor_log_formatter);
#endif

