spoemb/linkit-v4-core/ports/nrf52840/main.cpp
#if ENABLE_THERMISTOR_SENSOR
	DEBUG_TRACE("Thermistor Sensor Log...");
	ThermistorLogFormatter thermistor_sensor_log_formatter;
	FsLog thermistor_sensor_log(&lfs_file_system, "THERMISTOR", 1024*1024);
	thermistor_sensor_log.set_log_formatter(&thermistor_sensor_log_formatter);
#endif

#ifdef CAM_PWR_EN
	DEBUG_TRACE("CAM Sensor Log...");
	CAMLogFormatter cam_sensor_log_formatter;
	FsLog cam_sensor_log(&lfs_file_system, "CAM", 1024*1024);
	cam_sensor_log.set_log_formatter(&cam_sensor_log_formatter);
#endif

#if ENABLE_MORTALITY_SENSOR
	DEBUG_TRACE("Mortality Log...");
	FsLog mortality_log(&lfs_file_system, "MORTALITY", 64*1024);  // Small log, only needs last few entries
#endif

	DEBUG_TRACE("RAM access...");
	NrfMemoryAccess nrf_memory_access;
	memory_access = &nrf_memory_access;

	DEBUG_TRACE("DTE handler...");
	DTEHandler dte_handler_local;
	dte_handler = &dte_handler_local;

	DEBUG_TRACE("OTA updater...");
	ble_service = &BleInterface::get_instance();
	OTAFlashFileUpdater ota_flash_file_updater(&lfs_file_system, &is25_flash, IS25_BLOCK_COUNT - OTA_UPDATE_RESERVED_BLOCKS, OTA_UPDATE_RESERVED_BLOCKS);
	ota_updater = &ota_flash_file_updater;

	DEBUG_TRACE("SWS Analog...");
	static SWSAnalogService sws_analog;

#if ENABLE_SWS_LOG
	DEBUG_TRACE("SWS Log...");
	SWSLogFormatter sws_log_formatter;
	FsLog sws_log(&lfs_file_system, "SWS", 1024*1024);
	sws_log.set_log_formatter(&sws_log_formatter);
	SWSAnalogService::set_sws_logger(&sws_log);
#endif

#if defined(LORA_RAK3172) && (LORA_RAK3172 == 1)
	DEBUG_TRACE("LoRa RAK3172...");
	try {
		static LoRaDevice lora_rak3172;
		lora_device_instance = &lora_rak3172;
		static LoRaTxService lora_tx_service(lora_rak3172);
	} catch (...) {
		DEBUG_TRACE("LoRa RAK3172 not detected");
		lora_device_instance = nullptr;
	}
#elif defined(ARGOS_SMD) && (ARGOS_SMD == 1)
	DEBUG_TRACE("SMD Satellite...");
	try {
#if defined(SMD_UART) && (SMD_UART == 1)
		static SmdSatCmdAt smd_cmd;
#else
		static SmdSatCmdSpi smd_cmd;
#endif
		static SmdSat argos_smd(smd_cmd);
		smd_sat_instance = &argos_smd;  // Store pointer for SMD DFU OTA
		kineis_device_instance = &argos_smd;
		static ArgosTxService argos_tx_service(argos_smd);
	} catch (...) {
		DEBUG_TRACE("SMD not detected");
		smd_sat_instance = nullptr;
		kineis_device_instance = nullptr;
	}
#else
	DEBUG_TRACE("KIM2...");
	try {
		static KIM2Device kim2;
		kineis_device_instance = &kim2;
		static ArgosTxService argos_tx_service(kim2);
	} catch (...) {
		DEBUG_TRACE("KIM2 not detected");
		kineis_device_instance = nullptr;
	}
#endif

	// Always use M10Q GPS module
	DEBUG_TRACE("GPS M10Q ...");
	try {
		static M10QAsyncReceiver m10q_gnss;
		gps_device = &m10q_gnss;
		static GPSService gps_service(m10q_gnss, &fs_sensor_log);
		static GNSSDetectorService gps_detector(m10q_gnss);
	} catch (...) {
		DEBUG_TRACE("GPS M10Q not detected");
	}

#if ENABLE_PRESSURE_SENSOR || ENABLE_CDT_SENSOR
	DEBUG_TRACE("Pressure Sensor...");
	PressureSensorDevice *pressure_sensor_devices[BSP::I2C_TOTAL_NUMBER] = {nullptr};
#ifndef DUMMY_PRESSURE_SENSOR
	for (unsigned int i = 0; i < BSP::I2C_TOTAL_NUMBER; i++) {
		// Sensor detection order - LPS28DFW is default for RSPB board
#if defined(BOARD_RSPB)
		static unsigned int i2caddr[4] = { LPS28DFW_ADDRESS, MS5803_ADDRESS, MS5837_ADDRESS, BAR100_ADDRESS };
		static std::string variant[4] = { "LPS28DFW", MS5803_VARIANT, MS5837_VARIANT, "BAR100-R3-RP" };
#else
		static unsigned int i2caddr[4] = { MS5803_ADDRESS, MS5837_ADDRESS, BAR100_ADDRESS, LPS28DFW_ADDRESS };
		static std::string variant[4] = { MS5803_VARIANT, MS5837_VARIANT, "BAR100-R3-RP", "LPS28DFW" };
#endif
		for (unsigned int j = 0; j < 4; j++) {
			try {
				PressureSensorDevice *device;
#if defined(BOARD_RSPB)
				if (j == 0) {
					device = new LPS28DFW(i, i2caddr[j]);
				} else if (j == 3) {
					device = new Bar100(i, i2caddr[j]);
				} else {
					device = new MS58xxLL(i, i2caddr[j], variant[j]);
				}
#else
				if (j == 2) {
					device = new Bar100(i, i2caddr[j]);
				} else if (j == 3) {
					device = new LPS28DFW(i, i2caddr[j]);
				} else {
					device = new MS58xxLL(i, i2caddr[j], variant[j]);
				}
#endif
				pressure_sensor_devices[i] = device;
				DEBUG_TRACE("%s: found on i2cbus=%u i2caddr=0x%02x", variant[j].c_str(), i, i2caddr[j]);
				break;
			} catch (...) {
				DEBUG_TRACE("Nothing detected on i2cbus=%u i2caddr=0x%02x", i, i2caddr[j]);
				pressure_sensor_devices[i] = nullptr;
			}
		}
	}
#else
	pressure_sensor_devices[0] = new PressureSensorDummyDevice();
#endif

#if ENABLE_CDT_SENSOR
	DEBUG_TRACE("AD5933...");
	AD5933 *ad5933_devices[BSP::I2C_TOTAL_NUMBER];
	for (unsigned int i = 0; i < BSP::I2C_TOTAL_NUMBER; i++) {
		try {
			ad5933_devices[i] = new AD5933LL(i, AD5933_ADDRESS);
			DEBUG_TRACE("AD5933: found on i2cbus=%u i2caddr=0x%02x", i, AD5933_ADDRESS);
		} catch (...) {
			DEBUG_TRACE("AD5933: not detected on i2cbus=%u i2caddr=0x%02x", i, AD5933_ADDRESS);
			ad5933_devices[i] = nullptr;
		}
	}
#endif

	bool cdt_present = false;
	bool standalone_pressure = false;
	// Iterate twice to allows flags to be set
	for (unsigned int x = 0; x < 2; x++) {
		// Check available devices on each bus
		for (unsigned int i = 0; i < BSP::I2C_TOTAL_NUMBER; i++) {
#if ENABLE_CDT_SENSOR
			if (!cdt_present && ad5933_devices[i] && pressure_sensor_devices[i]) {
				DEBUG_TRACE("CDT on bus %u...", i);
				cdt_present = true;
				static CDT cdt(*pressure_sensor_devices[i], *ad5933_devices[i]);
				static CDTSensorService cdt_sensor_service(cdt, &cdt_sensor_log);
			} else
#endif
#if ENABLE_PRESSURE_SENSOR
			if (!standalone_pressure && pressure_sensor_devices[i]) {
				DEBUG_TRACE("Standalone Pressure Sensor on bus %u...", i);
				standalone_pressure = true;
				static PressureSensor pressure_sensor(*pressure_sensor_devices[i]);
				static PressureDetectorService pressure_detector(pressure_sensor);
				static PressureSensorService pressure_sensor_service(pressure_sensor, &pressure_sensor_log);
			}
#endif
			(void)i; // Suppress unused warning when both disabled
		}

		if (standalone_pressure && cdt_present)
			break;
	}
#endif // ENABLE_PRESSURE_SENSOR || ENABLE_CDT_SENSOR

#if ENABLE_ALS_SENSOR
	DEBUG_TRACE("LTR303...");
	try {
		static LTR303 ltr303;
		static ALSSensorService als_sensor_service(ltr303, &als_sensor_log);
	} catch (...) {
		DEBUG_TRACE("LTR303: not detected");
	}
#endif

#if ENABLE_PH_SENSOR
	DEBUG_TRACE("OEM PH...");
	try {
		static OEM_PH_Sensor ph;
		static PHSensorService ph_sensor_service(ph, &ph_sensor_log);
	} catch (...) {
		DEBUG_TRACE("OEM PH: not detected");
	}
#endif

